src/Documents/ИТСервисы_Задачи/ИТСервисы_Задачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ИТСервисы_Задачи</name>
  <registerRecords>InformationRegister.ИТСервисы_СостоянияЗадач</registerRecords>
  <registerRecords>AccumulationRegister.ИТСервисы_НагрузкаСотрудникаПоЗадачам</registerRecords>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.ИТСервисы_Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.ИТСервисы_СтатусыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>EnumRef.ИТСервисы_ПриоритетыЗадач</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПлановаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФактическаяТрудоемкость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ИнтеграционныйКонтур</name>
    <attributes>
      <name>UUIDСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>KaitenCardURL</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ИзмененПослеСинхронизации</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПоследнейСинхронизации</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ВнешнийСтатус</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/CommonModules/ИТСервисы_KaitenСинхронизацияСлужебный/Module.bsl
Функция БезопаснаяСтрока(Значение) Экспорт

	Если Значение = Неопределено Тогда
		Возврат "";
	КонецЕсли;

	Попытка
		Если НЕ ЗначениеЗаполнено(Значение) Тогда
			Возврат "";
		КонецЕсли;

		Результат = СокрЛП(Строка(Значение));

		Если Найти(Результат, "<Объект не найден>") > 0 Тогда
			Возврат "";
		КонецЕсли;

		Возврат Результат;
	Исключение
		Возврат "";
	КонецПопытки;

КонецФункции


Функция ОбновитьПоляСинхронизации(UUIDСтроки, KaitenID, KaitenCardURL, ВнешнийСтатус) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док";

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		НужноЗаписать = Ложь;

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

			Если БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки) = UUIDСтроки Тогда

				Если БезопаснаяСтрока(СтрокаЗадачи.KaitenID) <> KaitenID Тогда
					СтрокаЗадачи.KaitenID = KaitenID;
					НужноЗаписать = Истина;
				КонецЕсли;

				Если БезопаснаяСтрока(СтрокаЗадачи.KaitenCardURL) <> KaitenCardURL Тогда
					СтрокаЗадачи.KaitenCardURL = KaitenCardURL;
					НужноЗаписать = Истина;
				КонецЕсли;

				Если БезопаснаяСтрока(СтрокаЗадачи.ВнешнийСтатус) <> ВнешнийСтатус Тогда
					СтрокаЗадачи.ВнешнийСтатус = ВнешнийСтатус;
					НужноЗаписать = Истина;
				КонецЕсли;

				Если СтрокаЗадачи.ИзмененПослеСинхронизации Тогда
					СтрокаЗадачи.ИзмененПослеСинхронизации = Ложь;
					НужноЗаписать = Истина;
				КонецЕсли;

				СтрокаЗадачи.ДатаПоследнейСинхронизации = ТекущаяДата();
				НужноЗаписать = Истина;

				Если НужноЗаписать Тогда
					ОбъектДокумента.Записать();
				КонецЕсли;

				Возврат Истина;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат Ложь;

КонецФункции


Функция ПрименитьИзмененияИзKaiten(KaitenID, ВнешнийСтатус, KaitenCardURL) Экспорт

	Если ПустаяСтрока(БезопаснаяСтрока(KaitenID)) Тогда
		Возврат Ложь;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док";

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		НужноЗаписать = Ложь;

		Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

			Если БезопаснаяСтрока(СтрокаЗадачи.KaitenID) = KaitenID Тогда

				Если БезопаснаяСтрока(СтрокаЗадачи.ВнешнийСтатус) <> ВнешнийСтатус Тогда
					СтрокаЗадачи.ВнешнийСтатус = ВнешнийСтатус;
					НужноЗаписать = Истина;
				КонецЕсли;

				Если БезопаснаяСтрока(СтрокаЗадачи.KaitenCardURL) <> KaitenCardURL Тогда
					СтрокаЗадачи.KaitenCardURL = KaitenCardURL;
					НужноЗаписать = Истина;
				КонецЕсли;

				СтрокаЗадачи.ДатаПоследнейСинхронизации = ТекущаяДата();
				НужноЗаписать = Истина;

				Если НужноЗаписать Тогда
					ОбъектДокумента.Записать();
				КонецЕсли;

				Возврат Истина;

			КонецЕсли;

		КонецЦикла;

	КонецЦикла;

	Возврат Ложь;

КонецФункции


Процедура ИсправитьДублиUUID() Экспорт

	ВстреченныеUUID = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Док.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ИТСервисы_Задачи КАК Док
	|ГДЕ
	|	НЕ Док.ПометкаУдаления";

	ВыборкаДокументов = Запрос.Выполнить().Выбрать();

	Пока ВыборкаДокументов.Следующий() Цикл

		ОбъектДокумента = ВыборкаДокументов.Ссылка.ПолучитьОбъект();
		НужноЗаписать = Ложь;
		
		// Если ТЧ вообще пустая (для старых документов)
		Если ОбъектДокумента.ИнтеграционныйКонтур.Количество() = 0 Тогда
			НоваяСтрока = ОбъектДокумента.ИнтеграционныйКонтур.Добавить();
			НоваяСтрока.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
			НоваяСтрока.ИзмененПослеСинхронизации = Истина;
			НужноЗаписать = Истина;
		Иначе
			Для Каждого СтрокаЗадачи Из ОбъектДокумента.ИнтеграционныйКонтур Цикл

				ТекущийUUID = БезопаснаяСтрока(СтрокаЗадачи.UUIDСтроки);

				Если ПустаяСтрока(ТекущийUUID) Тогда
					СтрокаЗадачи.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
					СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;
					НужноЗаписать = Истина;
				ИначеЕсли ВстреченныеUUID.Получить(ТекущийUUID) <> Неопределено Тогда
					СтрокаЗадачи.UUIDСтроки = Строка(Новый УникальныйИдентификатор());
					СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;
					НужноЗаписать = Истина;
				Иначе
					ВстреченныеUUID.Вставить(ТекущийUUID, Истина);
					Если НЕ СтрокаЗадачи.ИзмененПослеСинхронизации Тогда
						СтрокаЗадачи.ИзмененПослеСинхронизации = Истина;
						НужноЗаписать = Истина;
					КонецЕсли;
				КонецЕсли;

			КонецЦикла;
		КонецЕсли;

		Если НужноЗаписать Тогда
			ОбъектДокумента.ДополнительныеСвойства.Вставить("ЭтоСлужебнаяЗаписьИнтеграции", Истина);
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры
